#pragma once
#include<iostream>

void logmenu(void);



void logmenu(void){
  printf("\033[0;36m==========================================================\033[0m\n");
  printf("           \033[0;33m欢迎进入聊天室,请选择要进行的操作\033[0m\n");
  printf("       \033[0;32m------------1.登录------------\033[0m\n");
  printf("       \033[0;32m------------2.注册------------\033[0m\n");
  printf("       \033[0;32m------------3.退出------------\033[0m\n");
  printf("\033[0;36m==========================================================\033[0m\n");

  printf("\033[0;32m请输入要选择功能的序号:>\033[0m");
  fflush(stdout); // 手动刷新标准输出缓冲区
}

