#pragma once
#include<iostream>

void startmenu(void);



void startmenu(void){
  printf("\033[0;36m==========================================================\033[0m\n");
  printf("           \033[0;33m欢迎进入聊天室,请选择要进行的操作\033[0m\n");
  printf("       \033[0;32m------------1.登录------------\033[0m\n");
  printf("       \033[0;32m------------2.注册------------\033[0m\n");
  printf("       \033[0;32m-----------3.找回密码----------\033[0m\n");
  printf("       \033[0;32m------------4.退出------------\033[0m\n");
  printf("\033[0;36m==========================================================\033[0m\n");

  printf("\033[0;32m请输入要选择功能的序号:>\033[0m");
  fflush(stdout); // 手动刷新标准输出缓冲区
}


void logmenu(){
    printf("\033[0;32m已选择登录选项(按下ESC可返回上一级菜单)\033[0m\n");
    printf("\033[0;32m请选择您的登录方式:\n\033[0m");
    printf("\033[0;33m1.用户名、密码登录\n\033[0m");
    printf("\033[0;33m2.邮箱、验证码登录\n\033[0m");
    printf("\033[0;32m请输入要选择的序号:>\033[0m");
    fflush(stdout); // 手动刷新标准输出缓冲区
}